In [2]:
import pandas as pd 
#create a simple, clean synthetic dataset
import numpy as np

In [3]:
import pandas as pd 
#create a simple, clean synthetic dataset
data = {
    "student_ID": [101,102,103,104,105],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [20, 21, 19, 22, 20],
    "grade": ["A", "B", "A", "C", "B"],
    "Department": ["Physics", "Chemistry", "Mathematics", "Biology", "Computer Science"]
}
df = pd.DataFrame(data)
df

   student_ID     name  age grade        Department
0         101    Alice   20     A           Physics
1         102      Bob   21     B         Chemistry
2         103  Charlie   19     A       Mathematics
3         104    David   22     C           Biology
4         105      Eva   20     B  Computer Science

In [4]:
#create a synthetic dataset, with Noise and missing values
data = {
    "student_ID": [101,102,103,104,None],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva", None],
    "age": [20, 21, 19, None, 22, None, 20],
    "grade": ["A", "B", "A","A", "C", "B",1009, None],
    "Department": ["Physics", "Chemistry", "Mathematics", "Biology", 42, "Computer Science", None]
}
df = pd.DataFrame(data)
df

ValueError: All arrays must be of the same length

In [ ]:
#create a synthetic dataset, with Noise and missing values
data = {
    "student_ID": [101,102,103,104,None,106, 108],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva", None, "John"],
    "age": [20, 21, 19, None, 22, None, 20],
    "grade": ["A", "B", "A","A", "B",1009, None],
    "Department": ["Physics", "Chemistry", "Mathematics", "Biology", 42, "Computer Science", None]
}
df = pd.DataFrame(data)
df

   student_ID     name   age grade        Department
0       101.0    Alice  20.0     A           Physics
1       102.0      Bob  21.0     B         Chemistry
2       103.0  Charlie  19.0     A       Mathematics
3       104.0    David   NaN     A           Biology
4         NaN      Eva  22.0     B                42
5       106.0     None   NaN  1009  Computer Science
6       108.0     John  20.0  None              None

In [5]:
import pandas as pd #
import numpy as np # random number generation

In [6]:
np. random. seed (42)
n = 10
np.random.randint(1, 100, 10 )
print (np. random. randint (1, 100, n))

[88 24  3 22 53  2 88 30 38  2]

In [7]:
#np. random. seed (42)
#n = 10
np.random.randint(1, 100, 10 )
print (np. random. randint (1, 100, n))

[59 42 92 60 80 15 62 62 47 62]

In [8]:
np.random.seed(41)
n = 1000
df = pd.DataFrame ({
    'student_ID': np.arange(101, 101+n),
    'age': np.random.randint(18, 30,size= n),
    'marks': np.random.randint(40, 100, size=n),
    'grade': np.random.choice(['A', 'B', 'C', 'D'], size=n),
    'Department': np.random.choice(["Physics", "Chemistry", "Mathematics", "Biology", "Computer Science"], size=n)

})

In [7]:
#introduce missing values in age and marks and department  columns
for col in ['age', 'marks', 'Department']:
    df.loc[df.sample(frac=0.05).index, col] = np.nan
df

     student_ID   age  marks grade        Department
0           101  18.0   81.0     A           Physics
1           102  21.0   56.0     A  Computer Science
2           103  20.0   99.0     C           Biology
3           104  18.0   59.0     B           Biology
4           105  19.0   67.0     C           Physics
..          ...   ...    ...   ...               ...
995        1096  23.0   76.0     B  Computer Science
996        1097  24.0   42.0     A           Biology
997        1098  25.0   79.0     D         Chemistry
998        1099  26.0   52.0     A           Physics
999        1100  18.0   60.0     A         Chemistry

[1000 rows x 5 columns]

In [9]:

df.head()

   student_ID  age  marks grade        Department
0         101   18     81     A           Physics
1         102   21     56     A  Computer Science
2         103   20     99     C           Biology
3         104   18     59     B           Biology
4         105   19     67     C           Physics

In [9]:
#duplicate records/rows
pd.concat([df, df.sample(10)], ignore_index=True)
df

     student_ID   age  marks grade        Department
0           101  18.0   81.0     A           Physics
1           102  21.0   56.0     A  Computer Science
2           103  20.0   99.0     C           Biology
3           104  18.0   59.0     B           Biology
4           105  19.0   67.0     C           Physics
..          ...   ...    ...   ...               ...
995        1096  23.0   76.0     B  Computer Science
996        1097  24.0   42.0     A           Biology
997        1098  25.0   79.0     D         Chemistry
998        1099  26.0   52.0     A           Physics
999        1100  18.0   60.0     A         Chemistry

[1000 rows x 5 columns]

In [10]:
#introduce invalid ages
df.loc[df.sample(10).index,"age"] = np.random.choice([-5, 150, 240], size=10)
df

     student_ID  age  marks grade        Department
0           101   18     81     A           Physics
1           102   21     56     A  Computer Science
2           103   20     99     C           Biology
3           104   18     59     B           Biology
4           105   19     67     C           Physics
..          ...  ...    ...   ...               ...
995        1096   23     76     B  Computer Science
996        1097   24     42     A           Biology
997        1098   25     79     D         Chemistry
998        1099   26     52     A           Physics
999        1100   18     60     A         Chemistry

[1000 rows x 5 columns]

In [11]:
#introduce OUTLIERS 
df.loc[df.sample(10).index,"marks"] = np.random.choice([-5, 150, 240], size=10)
df

     student_ID  age  marks grade        Department
0           101   18     81     A           Physics
1           102   21     56     A  Computer Science
2           103   20     99     C           Biology
3           104   18     59     B           Biology
4           105   19     67     C           Physics
..          ...  ...    ...   ...               ...
995        1096   23     76     B  Computer Science
996        1097   24     42     A           Biology
997        1098   25     79     D         Chemistry
998        1099   26     52     A           Physics
999        1100   18     60     A         Chemistry

[1000 rows x 5 columns]

In [12]:
#inconsistent text formatting
df["Department"] = df["Department"].astype(str)
df.loc[df.sample(frac=0.1).index, "Department"] = df["Department"].str.lower()
df
df.head()
df.tail()

     student_ID  age  marks grade        Department
995        1096   23     76     B  Computer Science
996        1097   24     42     A           Biology
997        1098   25     79     D         chemistry
998        1099   26     52     A           Physics
999        1100   18     60     A         Chemistry

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_ID  1000 non-null   int32
 1   age         950 non-null    float64
 2   marks       950 non-null    float64
 3   grade       1000 non-null   object
 4   Department  1000 non-null   object
dtypes: float64(2), int32(1), object(2)
memory usage: 35.3+ KB

In [14]:

df.isnull().sum()

student_ID     0
age           50
marks         50
grade          0
Department     0
dtype: int64

In [15]:
df.shape

(1000, 5)

In [16]:
df.columns

Index(['student_ID', 'age', 'marks', 'grade', 'Department'], dtype='object')

In [17]:
df.sample(10)

     student_ID   age  marks grade        Department
999        1100  18.0   60.0     A         Chemistry
383         484  18.0   97.0     D           Physics
699         800  29.0   89.0     D         Chemistry
291         392  22.0   49.0     B         Chemistry
316         417  22.0   58.0     B           Physics
38          139  20.0    NaN     C  Computer Science
134         235  26.0   45.0     A         chemistry
405         506  23.0   93.0     B       Mathematics
542         643  25.0   41.0     C         Chemistry
428         529  23.0   48.0     C         Chemistry

In [18]:
df.isnull().mean()*100

student_ID    0.0
age           5.0
marks         5.0
grade         0.0
Department    0.0
dtype: float64

In [19]:
df[df.isnull().any(axis=1)]

     student_ID   age  marks grade        Department
5           106  21.0    NaN     B       Mathematics
27          128  28.0    NaN     A           Physics
37          138  19.0    NaN     C           Biology
38          139  20.0    NaN     C  Computer Science
58          159   NaN   72.0     A  Computer Science
..          ...   ...    ...   ...               ...
891         992   NaN   97.0     C         Chemistry
918        1019  23.0    NaN     C  Computer Science
919        1020   NaN   41.0     C         Chemistry
962        1063   NaN   94.0     D           Biology
973        1074  29.0    NaN     C           physics

[97 rows x 5 columns]

In [20]:
df[df.isnull().any(axis=1)].count()

student_ID    97
age           47
marks         47
grade         97
Department    97
dtype: int64

In [21]:
df.duplicated().sum()

0

In [22]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [23]:
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [24]:
df.head()

   student_ID   age  marks grade        Department
0         101  18.0   81.0     A           Physics
1         102  21.0   56.0     A  Computer Science
2         103  20.0   99.0     C           Biology
3         104  18.0   59.0     B           biology
4         105  19.0   67.0     C           Physics

In [25]:
pd.reset_option('display.max_rows')
pd.reset_option('display.max_columns')

In [30]:
#display rows 500-600
df.iloc[500:601].to_string()

'     student_ID    age  marks grade        Department\n500         601   21.0   47.0     A               nan\n501         602   21.0   50.0     C           Biology\n502         603   28.0   93.0     A           Physics\n503         604   26.0   43.0     D           Physics\n504         605   22.0   74.0     B           Biology\n505         606  150.0   71.0     D       Mathematics\n506         607   25.0   73.0     C           Physics\n507         608   21.0   40.0     C  Computer Science\n508         609   20.0   52.0     C       Mathematics\n509         610   29.0   89.0     D  Computer Science\n510         611   19.0   89.0     A           Physics\n511         612   20.0   40.0     B         Chemistry\n512         613   25.0   96.0     B           Physics\n513         614   20.0   68.0     C  Computer Science\n514         615   24.0   66.0     B           Physics\n515         616   25.0   40.0     B         Chemistry\n516         617   21.0   72.0     B         Chemistry\n517         618   22.0   90.0     B  Computer Science\n518         619   29.0   64.0     C  Computer Science\n519         620   26.0   67.0     C         Chemistry\n520         621   22.0   90.0     D         Chemistry\n521         622   19.0   49.0     C           Biology\n522         623   21.0   86.0     C         Chemistry\n523         624   21.0   66.0     B           physics\n524         625   29.0   73.0     A       Mathematics\n525         626   23.0   72.0     D               nan\n526         627   23.0   77.0     B       Mathematics\n527         628   28.0   59.0     A  Computer Science\n528         629   27.0   71.0     A         Chemistry\n529         630   22.0   77.0     C           Biology\n530         631    NaN   71.0     C  Computer Science\n531         632   28.0   57.0     C  Computer Science\n532         633   28.0   97.0     B  Computer Science\n533         634   26.0   75.0     A  Computer Science\n534         635   29.0   60.0     D         Chemistry\n535         636   26.0   45.0     B         Chemistry\n536         637   18.0   61.0     B           Physics\n537         638   24.0   83.0     B  Computer Science\n538         639   22.0   56.0     C           Biology\n539         640   28.0   64.0     D       Mathematics\n540         641   18.0   45.0     B         Chemistry\n541         642   24.0   90.0     A       Mathematics\n542         643   25.0   41.0     C         Chemistry\n543         644   28.0   43.0     D           Physics\n544         645   18.0   91.0     C         Chemistry\n545         646   18.0   91.0     B           Biology\n546         647   27.0   54.0     B       Mathematics\n547         648    NaN   51.0     A         Chemistry\n548         649   23.0    NaN     C  Computer Science\n549         650    NaN   60.0     B           Physics\n550         651   27.0   61.0     A  Computer Science\n551         652   19.0   69.0     D         Chemistry\n552         653   19.0   70.0     C       Mathematics\n553         654   27.0   61.0     C         Chemistry\n554         655   20.0   84.0     B           Physics\n555         656   18.0   93.0     A               nan\n556         657   23.0   63.0     D  Computer Science\n557         658   18.0   72.0     D           Biology\n558         659   29.0   82.0     D           Physics\n559         660   21.0   61.0     D           Biology\n560         661   21.0   64.0     A  Computer Science\n561         662   27.0   84.0     C  Computer Science\n562         663   29.0   65.0     D           Biology\n563         664    NaN   60.0     D         Chemistry\n564         665   24.0   72.0     C           Physics\n565         666   27.0   82.0     B           Physics\n566         667   29.0   74.0     C           Physics\n567         668   28.0   78.0     B           Biology\n568         669   19.0   66.0     D           Biology\n569         670   20.0   51.0     D  Computer Science\n570         671   18.0   64.0     B           Biology\n571         672   20.0   62.0     D         Chemistry\n572         673   26.0   54.0     A  Computer Science\n573         674   23.0   71.0     B         Chemistry\n574         675   18.0   64.0     B  Computer Science\n575         676   23.0   42.0     B       Mathematics\n576         677   22.0   88.0     B           Biology\n577         678   29.0   66.0     D         Chemistry\n578         679   18.0   89.0     B  Computer Science\n579         680   22.0   90.0     B           Biology\n580         681   26.0   66.0     B  Computer Science\n581         682   21.0   98.0     D         Chemistry\n582         683   24.0   60.0     D               nan\n583         684   19.0   75.0     D         Chemistry\n584         685   22.0   58.0     D           Physics\n585         686   18.0   73.0     A         Chemistry\n586         687   25.0   76.0     A         chemistry\n587         688   25.0   90.0     A       Mathematics\n588         689   23.0   91.0     C       Mathematics\n589         690   28.0   81.0     A           Biology\n590         691  150.0   90.0     B       Mathematics\n591         692   24.0   97.0     B       Mathematics\n592         693   18.0   70.0     A  Computer Science\n593         694   29.0   43.0     D  Computer Science\n594         695   29.0   65.0     B           Biology\n595         696   29.0   92.0     A         Chemistry\n596         697   28.0    NaN     B           Physics\n597         698    NaN   97.0     A           Biology\n598         699   21.0   47.0     C         Chemistry\n599         700   27.0    NaN     A       Mathematics\n600         701   22.0   89.0     A           Biology'

In [27]:
#display rows 500-600
df.iloc[500:601]

     student_ID   age  marks grade   Department
500         601  21.0   47.0     A          nan
501         602  21.0   50.0     C      Biology
502         603  28.0   93.0     A      Physics
503         604  26.0   43.0     D      Physics
504         605  22.0   74.0     B      Biology
..          ...   ...    ...   ...          ...
596         697  28.0    NaN     B      Physics
597         698   NaN   97.0     A      Biology
598         699  21.0   47.0     C    Chemistry
599         700  27.0    NaN     A  Mathematics
600         701  22.0   89.0     A      Biology

[101 rows x 5 columns]

In [15]:
df.to_csv("student.xlsx",index=False)
df

     student_ID  age  marks grade        Department
0           101   18     81     A           Physics
1           102   21     56     A  Computer Science
2           103   20     99     C           Biology
3           104   18     59     B           Biology
4           105   19     67     C           Physics
..          ...  ...    ...   ...               ...
995        1096   23     76     B  Computer Science
996        1097   24     42     A           Biology
997        1098   25     79     D         chemistry
998        1099   26     52     A           Physics
999        1100   18     60     A         Chemistry

[1000 rows x 5 columns]

In [17]:
df.to_csv("student_data.csv",index=False)
df

     student_ID  age  marks grade        Department
0           101   18     81     A           Physics
1           102   21     56     A  Computer Science
2           103   20     99     C           Biology
3           104   18     59     B           Biology
4           105   19     67     C           Physics
..          ...  ...    ...   ...               ...
995        1096   23     76     B  Computer Science
996        1097   24     42     A           Biology
997        1098   25     79     D         chemistry
998        1099   26     52     A           Physics
999        1100   18     60     A         Chemistry

[1000 rows x 5 columns]

In [18]:
df.to_excel("student.xlsx", index=False)
df

     student_ID  age  marks grade        Department
0           101   18     81     A           Physics
1           102   21     56     A  Computer Science
2           103   20     99     C           Biology
3           104   18     59     B           Biology
4           105   19     67     C           Physics
..          ...  ...    ...   ...               ...
995        1096   23     76     B  Computer Science
996        1097   24     42     A           Biology
997        1098   25     79     D         chemistry
998        1099   26     52     A           Physics
999        1100   18     60     A         Chemistry

[1000 rows x 5 columns]